Revit 2027 API
AreaBasedLoadType.Create Method
 Creates an area based load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AreaBasedLoadType Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As AreaBasedLoadType
public:
static AreaBasedLoadType^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> AreaBasedLoadType
Parameters
document Document
 The document in which to create the area based load type.
name String
 The name of new area based load type. The actual name may be post-fixed if already exists.
Return Value
AreaBasedLoadType
 The newly created area based load type.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace